Infineon/micropython/ports/psoc6/modbluetooth.c
    // Parse and populate elements
    offset = 0;
    *num_elements = 0;

    while (offset < adv_len && *num_elements < element_count) {
        uint8_t field_len = adv_data[offset];
        uint8_t field_type = adv_data[offset + 1];

        if (field_len == 0 || offset + field_len + 1 > adv_len) {
            break;
        }

        // Allocate memory for this element's data
        uint8_t *element_data = (uint8_t *)malloc(field_len);
        if (!element_data) {
            // Cleanup on failure
            for (int i = 0; i < *num_elements; i++) {
                free((*adv_elements)[i].p_data);
            }
            free(*adv_elements);
            *adv_elements = NULL;
            return WICED_BT_NO_RESOURCES;
        }

        // Copy the data (excluding the length byte)
        memcpy(element_data, &adv_data[offset + 1], field_len);

        // Map Bluetooth SIG AD types to WICED BLE advert types
        wiced_bt_ble_advert_elem_t *element = &(*adv_elements)[*num_elements];
        element->len = field_len;
        element->p_data = element_data;

        // Map common AD types
        switch (field_type) {
            case 0x01: // Flags
                element->advert_type = BTM_BLE_ADVERT_TYPE_FLAG;
                break;
            case 0x02: // Incomplete List of 16-bit Service Class UUIDs
                element->advert_type = BTM_BLE_ADVERT_TYPE_16SRV_PARTIAL;
                break;
            case 0x03: // Complete List of 16-bit Service Class UUIDs
                element->advert_type = BTM_BLE_ADVERT_TYPE_16SRV_COMPLETE;
                break;
            case 0x06: // Incomplete List of 128-bit Service Class UUIDs
                element->advert_type = BTM_BLE_ADVERT_TYPE_128SRV_PARTIAL;
                break;
            case 0x07: // Complete List of 128-bit Service Class UUIDs
                element->advert_type = BTM_BLE_ADVERT_TYPE_128SRV_COMPLETE;
                break;
            case 0x08: // Shortened Local Name
                element->advert_type = BTM_BLE_ADVERT_TYPE_NAME_SHORT;
                break;
            case 0x09: // Complete Local Name
                element->advert_type = BTM_BLE_ADVERT_TYPE_NAME_COMPLETE;
                break;
            case 0x0A: // Tx Power Level
                element->advert_type = BTM_BLE_ADVERT_TYPE_TX_POWER;
                break;
            case 0x16: // Service Data - 16-bit UUID
                element->advert_type = BTM_BLE_ADVERT_TYPE_SERVICE_DATA;
                break;
            case 0xFF: // Manufacturer Specific Data
                element->advert_type = BTM_BLE_ADVERT_TYPE_MANUFACTURER;
                break;
            default:
                // For unknown types, use raw data type
                element->advert_type = BTM_BLE_ADVERT_TYPE_MANUFACTURER;
                break;
        }

        (*num_elements)++;
        offset += field_len + 1;
    }

    return WICED_SUCCESS;
}

// *********************************** MTB wrapper API's and callbacks *******************************************

// ToDo : Add better function names to clearly differentiate API's purely using MTB vs MPY vs MPY+MTB

static void stop_advertisement(void) {
    wiced_result_t status = WICED_BT_SUCCESS;
    status = wiced_bt_start_advertisements(BTM_BLE_ADVERT_OFF, 0, NULL);
    bluetooth_assert_raise_val("Stopping Bluetooth LE advertisements failed with error: ", status, WICED_SUCCESS);
}


static void start_advertisement(void) {
    wiced_result_t wiced_status;

    /* Set Advertisement Data */
    wiced_status = wiced_bt_ble_set_raw_advertisement_data(NUM_ADV_PACKETS,
        cy_bt_adv_packet_data);
    if (WICED_SUCCESS != wiced_status) {
        mp_printf(&mp_plat_print, "Raw advertisement failed with err 0x%x\n", wiced_status);
    }

    /* Do not allow peer to pair */
    wiced_bt_set_pairable_mode(WICED_TRUE, FALSE);

    /* Start Undirected LE Advertisements on device startup. */
    wiced_status = wiced_bt_start_advertisements(BTM_BLE_ADVERT_UNDIRECTED_HIGH,
        BLE_ADDR_PUBLIC,
        NULL);

    if (WICED_SUCCESS != wiced_status) {
        mp_printf(&mp_plat_print, "Starting undirected Bluetooth LE advertisements"
            "Failed with err 0x%x\n", wiced_status);
    }

}

// Handles GATT events from the BT stack
static wiced_bt_gatt_status_t gatt_event_callback(wiced_bt_gatt_evt_t event,
    wiced_bt_gatt_event_data_t *p_event_data) {
    wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_SUCCESS;

    switch (event)
    {
        case GATT_CONNECTION_STATUS_EVT:
            if (p_event_data->connection_status.connected) {
                mp_printf(&mp_plat_print, "Device connected\n");
            } else {
                mp_printf(&mp_plat_print, "Device disconnected\n");
                /* Restart advertising when disconnected */
                start_advertisement();
            }
            break;

        default:
            break;
    }

    return gatt_status;
}

// Initialize mandatory sub-layers
static void ble_init() {
    wiced_bt_gatt_status_t gatt_status = WICED_BT_GATT_ERROR;

    /* Register with BT stack to receive GATT callback */
    gatt_status = wiced_bt_gatt_register(gatt_event_callback);

    /* Initialize GATT Database */
    gatt_status = wiced_bt_gatt_db_init(gatt_database, gatt_database_len, NULL);
    if (WICED_BT_GATT_SUCCESS != gatt_status) {
        mp_printf(&mp_plat_print, "\n GATT DB Initialization failed with err 0x%x\n", gatt_status);
    }
}

// Receive management events from the LE stack
wiced_result_t bt_management_callback(wiced_bt_management_evt_t event,
    wiced_bt_management_evt_data_t *p_event_data) {
    wiced_result_t wiced_result = WICED_BT_SUCCESS;

    switch (event)
    {
        case BTM_ENABLED_EVT:
            /* Bluetooth Controller and Host Stack Enabled */
            if (WICED_BT_SUCCESS == p_event_data->enabled.status) {
                /* Perform application-specific initialization */
                ble_init();
            } else {
                mp_printf(&mp_plat_print, "Bluetooth disabled \n");
            }
            break;

