Infineon/micropython/ports/psoc6/modbluetooth.c
int mp_bluetooth_gap_advertise_start(bool connectable, int32_t interval_us,
    const uint8_t *adv_data, size_t adv_data_len,
    const uint8_t *sr_data, size_t sr_data_len) {

    if (!mp_bluetooth_is_active()) {
        return ERRNO_BLUETOOTH_NOT_ACTIVE;
    }

    wiced_result_t result = WICED_BT_SUCCESS;
    // Static storage for last used adv/scanned data
    static wiced_bt_ble_advert_elem_t *last_adv_elements = NULL;
    static uint8_t last_num_adv_elements = 0;
    static wiced_bt_ble_advert_elem_t *last_sr_elements = NULL;
    static uint8_t last_num_sr_elements = 0;

    // Stop advertising if interval_us is 0 or None
    if (interval_us == 0) {
        stop_advertisement();
        return 0;
    } else {
        mp_printf(&mp_plat_print, "Advertising interval is ignored and set to default interval internally - 0x0020 to 0x4000\r\n");
    }

    // Handle adv_data
    if (adv_data == NULL) {
        // Reuse previous
        adv_data = NULL;
        adv_data_len = 0;
    }
    if (adv_data_len == 0 && last_adv_elements) {
        // Clear previous
        free_advert_elements(last_adv_elements, last_num_adv_elements);
        last_adv_elements = NULL;
        last_num_adv_elements = 0;
    }
    if (adv_data && adv_data_len > 0) {
        if (last_adv_elements) {
            free_advert_elements(last_adv_elements, last_num_adv_elements);
        }
        result = parse_ltv_to_advert_elements(adv_data, adv_data_len, &last_adv_elements, &last_num_adv_elements);
        if (result != WICED_SUCCESS) {
            return result;
        }
    }

    // Handle scan response data
    if (sr_data == NULL) {
        sr_data = NULL;
        sr_data_len = 0;
    }
    if (sr_data_len == 0 && last_sr_elements) {
        free_advert_elements(last_sr_elements, last_num_sr_elements);
        last_sr_elements = NULL;
        last_num_sr_elements = 0;
    }
    if (sr_data && sr_data_len > 0) {
        if (last_sr_elements) {
            free_advert_elements(last_sr_elements, last_num_sr_elements);
        }
        result = parse_ltv_to_advert_elements(sr_data, sr_data_len, &last_sr_elements, &last_num_sr_elements);
        if (result != WICED_SUCCESS) {
            return result;
        }
    }

    // Set advertisement data
    result = wiced_bt_ble_set_raw_advertisement_data(last_num_adv_elements, last_adv_elements);
    if (result != WICED_SUCCESS) {
        return result;
    }

    if (sr_data && sr_data_len > 0) {
        result = wiced_bt_ble_set_raw_scan_response_data(last_num_sr_elements, last_sr_elements);
        if (result != WICED_SUCCESS) {
            return result;
        }
    }

    // Start advertising
    result = wiced_bt_start_advertisements(BTM_BLE_ADVERT_UNDIRECTED_HIGH, BLE_ADDR_PUBLIC, NULL);

    return result;
}


// Stop advertisement. No-op when already stopped.
void mp_bluetooth_gap_advertise_stop(void) {
    wiced_result_t wiced_status;
    if (!mp_bluetooth_is_active()) {
        return;
    }
    wiced_status = wiced_bt_start_advertisements(BTM_BLE_ADVERT_OFF, 0, NULL);
    bluetooth_assert_raise_val("Stopping Bluetooth LE advertisements failed with error: ", wiced_status, WICED_SUCCESS);
    return;
}

#if MICROPY_PY_BLUETOOTH_ENABLE_CENTRAL_MODE

int get_adv_data_length(const uint8_t *p_adv_data) {
    int offset = 0;
    while (offset < 31) { // BLE adv max length is 31 bytes
        uint8_t field_len = p_adv_data[offset];
        if (field_len == 0 || (offset + field_len + 1) > 31) {
            break;
        }
        offset += field_len + 1;
    }
    return offset;
}

void mp_scan_result_callback(wiced_bt_ble_scan_results_t *p_scan_result,
    uint8_t *p_adv_data) {
    printf("Scan works\r\n");
    if (p_scan_result) {
        mp_bluetooth_gap_on_scan_complete();
    } else {
        mp_printf(&mp_plat_print, "No device found\n");
    }
    // Calculate actual length of adv data
    int adv_data_len = get_adv_data_length(p_adv_data);
    mp_bluetooth_gap_on_scan_result(p_scan_result->ble_addr_type, p_scan_result->remote_bd_addr, p_scan_result->ble_evt_type, p_scan_result->rssi, p_adv_data, adv_data_len);

}

int mp_bluetooth_gap_scan_start(int32_t duration_ms, int32_t interval_us, int32_t window_us, bool active_scan) {
    return 0;
}

// Stop discovery
int mp_bluetooth_gap_scan_stop(void) {
    wiced_result_t result = wiced_bt_ble_scan(
        BTM_BLE_SCAN_TYPE_NONE,
        WICED_TRUE,
        NULL
        );

    bluetooth_assert_raise_val("Stopping Bluetooth LE scanning failed with error: ", result, WICED_SUCCESS);

    return 0;
}

// Connect to a found peripheral.
int mp_bluetooth_gap_peripheral_connect(uint8_t addr_type, const uint8_t *addr, int32_t duration_ms, int32_t min_conn_interval_us, int32_t max_conn_interval_us) {
    // ret_status = wiced_bt_gatt_le_connect( p_scan_result->remote_bd_addr, p_scan_result->ble_addr_type, BLE_CONN_MODE_LOW_DUTY, TRUE );
    // printf( "wiced_bt_gatt_connect status %d\r\n", ret_status );
    return 0;
}

// Cancel in-progress connection to a peripheral.
int mp_bluetooth_gap_peripheral_connect_cancel(void) {
    return 0;
}

#endif // MICROPY_PY_BLUETOOTH_ENABLE_CENTRAL_MODE


// Start adding services. Must be called before mp_bluetooth_register_service.
int mp_bluetooth_gatts_register_service_begin(bool append) {
    return 0;
}
// Add a service with the given list of characteristics to the queue to be registered.
// The value_handles won't be valid until after mp_bluetooth_register_service_end is called.
int mp_bluetooth_gatts_register_service(mp_obj_bluetooth_uuid_t *service_uuid, mp_obj_bluetooth_uuid_t **characteristic_uuids, uint16_t *characteristic_flags, mp_obj_bluetooth_uuid_t **descriptor_uuids, uint16_t *descriptor_flags, uint8_t *num_descriptors, uint16_t *handles, size_t num_characteristics) {
    return 0;
}
// Register any queued services.
int mp_bluetooth_gatts_register_service_end(void) {
    return 0;
}

// Read the value from the local gatts db (likely this has been written by a central).
int mp_bluetooth_gatts_read(uint16_t value_handle, const uint8_t **value, size_t *value_len) {
    return 0;
}
// Write a value to the local gatts db (ready to be queried by a central). Optionally send notifications/indications.
int mp_bluetooth_gatts_write(uint16_t value_handle, const uint8_t *value, size_t value_len, bool send_update) {
    return 0;
}
// Send a notification/indication to the central, optionally with custom payload (otherwise the DB value is used).
int mp_bluetooth_gatts_notify_indicate(uint16_t conn_handle, uint16_t value_handle, int gatts_op, const uint8_t *value, size_t value_len) {
    return 0;
}

